Cadena_Favores/app/controllers/chains_controller.rb

	def create

		@chain_params = params[:newChain]
		@chain = Chain.new
		@chain.name = @chain_params["name"]
		@chain.date_chain = @chain_params["date"]
		@chain.description_chain = @chain_params["description"]

		if @chain.save
---
INSERT INTO "chains" ("name", "date_chain", "description_chain", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "fasdf"], ["date_chain", "2015-06-10"], ["description_chain", "sfasdfa"], ["created_at", "2015-06-19 13:13:37.018650"], ["updated_at", "2015-06-19 13:13:37.018650"]]