Cadena_Favores/app/controllers/chains_controller.rb

SELECT "chains".* FROM "chains"
SELECT  "chains".* FROM "chains" WHERE "chains"."id" = ? LIMIT 1  [["id", 1]]
---
	def index
		@chains = Chain.all
		@chain = Chain.find 1

SELECT  "chains".* FROM "chains" WHERE "chains"."id" = ? LIMIT 1  [["id", 0]]
SELECT  "userposts".* FROM "userposts" WHERE "userposts"."chain_id" = ?  ORDER BY "userposts"."id" ASC LIMIT 1  [["chain_id", 1]]
---
	def show
		@chain = Chain.find params[:id]
		latitude = @chain.userposts.first.latitude.to_f