Cadena_Favores/app/controllers/userposts_controller.rb

SELECT  "chains".* FROM "chains" WHERE "chains"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "userposts" ("comment", "user", "city", "chain_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "asdf"], ["user", "sdaf"], ["city", "sdaf"], ["chain_id", 1], ["created_at", "2015-06-05 11:04:45.460108"], ["updated_at", "2015-06-05 11:04:45.460108"]]
---
	def create
		comment = params[:comment]
		user = params[:user]
		address = params[:city]

		chain = Chain.find(params[:chain_id])
		chain.userposts.create comment: comment, user: user, address: address