Cadena_Favores/app/views/chains/index.html.erb


	<% chain.userposts.each do |userpost| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."chain_id" = ?  [["chain_id", 1]]
SELECT "userposts".* FROM "userposts" WHERE "userposts"."chain_id" = ?  [["chain_id", 1]]